# 0 부터 20까지 정수를 2개를 더해서 20을 만드는 가짓수
#  1, 1
# 1
# 1 , 2
# 2
# 1, 3
# 3

# 2 , 1
# 1
# 2 , 2
# 3
# 2 , 3
# 6

# 3 , 1
# 1
# 3 , 2
# 4
# 3 , 3
# 10

# 4 , 1
# 1 
# 4 , 2
# 5
# 4 , 3
# 15

# [0 0 0 0 0 ..]
# [0 1 2 3]
# [0 1 3 6]
# [0 1 4 10]
# [0 1 5 15]

# dp[n][k] = dp[n-1][k] + dp[n][k-1]
n , k = map(int ,input().split());

dp = [[0] * (k+1) for _ in range(n+1)];


dp[0][0] = 1;
for i in range(0,n+1):
    
    for j in range(1,k+1):
        dp[i][j] = dp[i-1][j] + dp[i][j-1];

print(dp[n][k]);

